# frozen_string_literal: true
# rubocop:disable LineLength
# rubocop:disable Style/WordArray
namespace :staging do
  task bootstrap: [:'db:migrate'] do
    # Create Book Infos

    book_info_data = [
      [
        '9789862017050',
        nil,
        '無瑕的程式碼：敏捷軟體開發技巧守則',
        'Robert C. Martin',
        '博碩',
        '2013-03-22',
        'http://i.imgur.com/VLJgxcy.jpg'
      ],
      [
        '9789863200611',
        nil,
        '快思慢想',
        'Daniel Kahneman',
        '天下文化',
        '2012-10-31',
        'http://i.imgur.com/PUpmuAS.jpg'
      ],
      [
        '4719025006787',
        nil,
        '桌遊課：原來我玩的不只是桌遊，是人生',
        '許榮哲、歐陽立中',
        '遠流',
        '2016-11-30',
        'http://i.imgur.com/OLqf4YP.jpg'
      ],
      [
        '9789571367712',
        nil,
        '孤獨的價值',
        '森博嗣',
        '時報出版',
        '2016-09-20',
        'http://i.imgur.com/n3aaM8V.jpg'
      ],
      [
        '4717211022504',
        nil,
        '價值主張年代',
        nil,
        '天下雜誌',
        '2016-03-03',
        'http://i.imgur.com/95BKpLK.jpg'
      ],
      [
        '9789869272049',
        nil,
        '殘酷日本',
        '湯禎兆',
        '奇異果文創事業有限公司',
        '2016-06-16',
        'http://i.imgur.com/gYrKLxd.jpg'
      ],
      [
        '9789869111751',
        nil,
        '悶騷日本',
        '湯禎兆',
        '奇異果文創事業有限公司',
        '2015-01-07',
        'http://i.imgur.com/E0TVGn0.jpg'
      ],
      [
        '9789863207962',
        nil,
        '無印良品培育人才祕笈',
        '松井忠三',
        '天下文化',
        '2015-08-28',
        'http://i.imgur.com/sq3kJH5.jpg'
      ],
      [
        '9789866613531',
        nil,
        '獲利世代',
        '亞歷山大．奧斯瓦爾德⋯⋯等人',
        '早安財經',
        '2012-11-29',
        'http://i.imgur.com/UOR5by7.jpg'
      ],
      [
        '9789862485880',
        nil,
        '超級預測：洞悉思考的藝術與科學，在不確定的世界預見未來優勢',
        'Philip E. Tetlock, Dan Gardner',
        '寶鼎',
        '2016-09-02',
        'http://i.imgur.com/AFuAvn3.jpg'
      ],
      [
        '10294813',
        nil,
        'IdN v23n4：互動媒體與設計 — UX & UI',
        nil,
        '聯華書報社',
        '2016-12-20',
        'http://i.imgur.com/gcNzqc9.jpg'
      ],
      [
        '9783836545303',
        'en',
        'Logo Modernism',
        'Jens/ Remington, R. Roger (CON)',
        'Taschen America Llc',
        '2015-11-10',
        'http://i.imgur.com/B1Pt83d.png'
      ],
      [
        '9789863205449',
        nil,
        '人類大歷史：從野獸到扮演上帝',
        'Yuval Noah Harari',
        '天下文化',
        '2014-08-27',
        'http://i.imgur.com/ye2Ea4B.jpg'
      ],
      [
        '9789869214148',
        nil,
        '重返 Ｗabi-Sabi：給日式生活愛好者的美學思考',
        '李歐納．科仁',
        '行人',
        '2015-10-23',
        'http://i.imgur.com/jge7ZOG.jpg'
      ],
      [
        '9789868711235',
        nil,
        'Wabi-Sabi：給設計者、生活家的日式美學基礎',
        '李歐納．科仁',
        '行人',
        '2011-07-29',
        'http://i.imgur.com/8QcobqC.jpg'
      ],
      [
        '9789861736600',
        nil,
        'Ex-formation 植物：視覺藝術聯想集',
        '原研哉',
        '麥田',
        '2010-07-09',
        'http://i.imgur.com/RQYm6ST.jpg'
      ],
      [
        '9789868746015',
        nil,
        '一個孤獨漫步者的遐想',
        '盧梭',
        '自由之丘',
        '2012-02-12',
        'http://i.imgur.com/FjpJZ9f.jpg'
      ],
      [
        '9789863208563',
        nil,
        '無印良品的設計',
        '日經設計',
        '天下文化',
        '2015-10-30',
        'http://i.imgur.com/zzRhvBK.jpg'
      ],
      [
        '9789869356251',
        nil,
        '超智慧：出現途徑、可能危機，與我們的因應對策',
        'Nick Bostrom',
        '八旗文化',
        '2016-10-05',
        'http://i.imgur.com/OR6NK3t.jpg'
      ],
      [
        '9789862354254',
        nil,
        '一個嚮往清晰的夢：荷蘭現代主義的設計公司與視覺識別 1960-1975',
        'Wibo Bakker',
        '臉譜',
        '2015-04-30',
        'http://i.imgur.com/qPXZSck.jpg'
      ],
      [
        '9789571365954',
        nil,
        '品味，從知識開始',
        '水野學',
        '時報出版',
        '2016-05-03',
        'http://i.imgur.com/F3DrhmA.jpg'
      ]
    ]

    book_info_data.each_with_index do |data, i|
      puts "creating book info (#{i + 1} of #{book_info_data.count})"
      book_info = BookInfo.new(
        isbn: data[0],
        language: data[1],
        name: data[2],
        author: data[3],
        publisher: data[4],
        publish_date: data[5],
        cover_image: BookInfo::CoverImage.create!(remote_image_url: data[6])
      )
      book_info.save!(validate: false)
    end

    # Create Users

    usernames = [
      'glenda',
      'aliya',
      'tyler',
      'bradford',
      'afton',
      'kacie',
      'meggie',
      'markus',
      'verdie',
      'davin',
      'port',
      'capacitor',
      'transmitter',
      'monitor',
      'panel',
      'card',
      'firewall',
      'interface'
    ]

    names = [
      '林政宏',
      '吳姿吟',
      '江萱樂',
      '童清真',
      '黃月淳',
      '林呈妍',
      '張育德',
      '傅祐誠',
      '鄭佩玲',
      '謝愛筠',
      '王淑娟',
      '潘雯婷',
      '朱郁翔',
      '黃禎岑',
      '林景苓',
      '蔡明容',
      '劉有如',
      '盧哲宇',
      '賴于婷',
      '陳明倫',
      '游俊德',
      '張佩穎',
      '林姿惟',
      '方家維',
      '廖婉啟',
      '胡雅雯',
      '李冠佩',
      '胡瓊宜',
      '林信秀',
      '汪昇盈',
      '李坤春',
      '賁翠如',
      '陳嘉惠',
      '黃淑來',
      '黃育菁',
      '蕭睿霞',
      '張平蕙',
      '朱世昌',
      '馮怡伶',
      '林孟柏',
      '劉璇鑫',
      '張茂陽',
      '陳筱任',
      '黃思雲',
      '李佩旺',
      '鄭政憲',
      '黃國榮',
      '許原豐',
      '黃依婷',
      '張元哲',
      '曹文欣',
      '黃惠文',
      '林雅劭',
      '林盈來',
      '陳佳芝',
      '黃嘉元',
      '陳冠汝',
      '陳思冰',
      '黃佐樂',
      '婁光伶',
      '陳家其',
      '王靜怡',
      '謝嬌蓉',
      '王建宏',
      '陳宗憲',
      '林芝汝',
      '李依妹',
      '潘素貞',
      '孫世昌',
      '周裕瑄',
      '黃必羽',
      '李雅晴',
      '黃秀念',
      '柳上瑜',
      '李立盈',
      '錢俊翔',
      '蔡泓能',
      '林信宏',
      '張淑萍',
      '洪婉君',
      '李哲榮',
      '楊湖軍',
      '陳家瑋',
      '錢怡君',
      '張雅名',
      '謝宜民',
      '姜筱婷',
      '方沛其',
      '楊峻彬',
      '王子萍',
      '黃則蓉',
      '吳昱胤',
      '孟宜婷',
      '張琬銘',
      '張志祥',
      '陳宣紋',
      '林佩琦'
    ]

    paragraphs = [
      '流，眼不盲，就這悲哀的人生也是因人差異，難得見這一點希冀的青芽，無形的解差永遠在後背催逼著我們趕道：為什麼受罪，雖則我聽說他的名字常在你的口邊，我的小彼得，她也何嘗有一天接近過快樂與幸福，你才知道靈魂的愉快是怎樣的，你一個人漫遊的時候，你應得躲避她像你躲避青草裡一條美麗的花蛇！',
      '小馬，自然是最偉大的一部書，沒福見著你的父親，所以只有你單身奔赴大自然的懷抱時，就這悲哀的人生也是因人差異，至少你不能完全抱怨荊棘，但你應得帶書，最有資格指證或相詮釋，而且往往因為他是從繁花的山林裡吹度過來他帶來一股幽遠的淡香，我們始終不曾明白，連著一息滋潤的水氣，但我的情愫！扮一個漁翁，作客山中的妙處，從你襁褓時起，不吞苦水的經驗，只要把話匣開上，我們應得感謝上蒼的是他不可度量的心裁，今天已是壯年；昨天腮邊還帶著圓潤的笑渦，你得有力量翻起那岩石才能把它不傷損的連根起出誰知道那根長的多深！',
      '光亮的天真，只要你自己心靈上不長瘡瘢，但我們，平常我們從自己家裡走到朋友的家裡，我拉著他的手，把一個小花圈掛上你的門前那時間我，雲彩裡，美慧，你便乖乖的把琴抱進你的床去，解嘲已往的一切。',
      '但我不僅不能盡我的責任，那才是你實際領受，我們唯一的權利，我只能問！講，她們不僅永遠把你放在她們心坎的底裏，但她在她同樣不幸的境遇中證明她的智斷，你離開了媽的懷抱，這次我再來歐洲你已經早一個星期回去，我不能恨，他拉著我的手，是貝德花芬是槐格納你就愛，體態的秀美，是它們自己長著，你知道的是慈母的愛，只要你自己心靈上不長瘡瘢，你媽說，誰沒有悵惘？',
      '你的父親，許是怨，別管他模樣不佳，在這裡出門散步去，我們唯一的權利，那天在柏林的會館裏，決不過暖；風息是溫馴的，並且這書上的文字是人人懂得的；阿爾帕斯與五老峰，只要你一伸手就可以採取，或是看見小貓追他自己的尾巴，你得有力量翻起那岩石才能把它不傷損的連根起出誰知道那根長的多深！',
      '同是一滴眼淚，我拉著他的手，也不能給我們利益，圓滿這全程的寂寞，我既是你的父親，但你要它們的時候，卻難尋同樣的淚晶。你在時穿著的衣褂鞋帽你媽與你大大也曾含著眼淚從箱裏理出來給我撫摩，認識你，但我們，竟可說是你有天賦的憑證，但你要它們的時候，你便蓋沒了你的小耳，扮一個漁翁，此外還有不少趣話，對著這不完全，不止是苦，卻不是來作客；我們是遭放逐，為什麼要到這時候，反是這般不近情的冷漠？',
      '活潑，她也何嘗有一天接近過快樂與幸福，約莫八九歲光景，你愛好音樂的故事，假如我在萬里外接到你的死耗，想中止也不可能，你穿來的白衣不曾沾著一斑的泥污。你便蓋沒了你的小耳，他上年紀的臉上一定滿佈著笑容你的小腳踝上不曾碰著過無情的荊刺，但你要它們的時候，裝一個農夫，作客山中的妙處，同是一個碎心，荊棘刺入了行路人的脛踝，決意不讓無意味的鑼鼓，他才知道這路的難走；但為什麼有荊棘？',
      '同在和風中波動他們應用的符號是永遠一致的，因此你得嚴格的為己，極端的自私，直到你的影像活現在我的眼前，別管他模樣不佳，無形的解差永遠在後背催逼著我們趕道：為什麼受罪，耳不塞，裝一個獵戶；你再不必提心整理你的領結，反是這般不近情的冷漠？',
      '也只有她，活潑，但我們的枷，許是懺悔，那邊每株樹上都是滿掛著詩情最秀逸的果實，至少你不能完全抱怨荊棘，因此我想說的話或許還有人聽，他會拉，也不能給我們利益，輕繞著你的肩腰，明知是自苦的揶揄，那才是你實際領受，你才知道靈魂的愉快是怎樣的，挫折時有鼓勵，站在漆黑的床邊，但我的情愫！',
      '但我們的枷，也不免加添他們的煩愁，比如去一果子園，是懺悔，後來怎樣她們干涉了你，甚至有時打滾，他們承著你的體重卻不叫你記起你還有一雙腳在你的底下。在你住處的客室裡，我們唯一的權利，窮困時不窮困，一同聽台上的音樂。',
      '今天已是壯年；昨天腮邊還帶著圓潤的笑渦，或是看見小貓追他自己的尾巴，這時候想回頭已經太遲，把一個小花圈掛上你的門前那時間我，是在火車上，你才知道靈魂的愉快是怎樣的，因此我想說的話或許還有人聽，美慧，你一個人漫遊的時候，不是荊棘自動來刺你但又誰知道？山罅裡的泉響，是懺悔，誰不曾在他生命的經途中葛德說的和著悲哀吞他的飯，誰沒有悵惘？他們的獨子，平常我們從自己家裡走到朋友的家裡，它們又不在口邊；像是長在大塊岩石底下的嫩草，也許是你自己種下的？
'
    ]

    10.times do |i|
      puts "creating user (#{i + 1} of 10)"
      username = usernames.sample
      usernames.delete username
      name = names.sample
      names.delete name

      user = User.create!(
        email: "#{username}@example.com",
        password: username,
        username: username,
        name: name,
        confirmed_at: Time.current
      )

      (7..10).to_a.sample.times do
        book_info = BookInfo.all.sample

        Book.create(
          owner: user,
          info: book_info
        )

        Book::Story.create(
          user: user,
          book_isbn: book_info.isbn,
          published_at: Time.current,
          content: paragraphs.sample + "\n\n" + paragraphs.sample + "\n\n" + paragraphs.sample + "\n",
          privacy_level: :open_to_world
        )
      end
    end

    # Create Admin

    puts "creating admin"
    Admin.create!(
      email: 'admin@example.com',
      password: 'admin'
    )

    puts 'bootstraped!'
  end
end
